
let Q = [//クイズ
'Q.日本で一番高い山は？',
' onclick="Q_1(1);" >富士山',
' onclick="Q_1(2);" >北岳', 
' onclick="Q_1(2);" >奥穂高岳', 
' onclick="Q_1(2);" >高尾山', 
'日本で一番高い山は富士山。なんと3,776Mもあります。',

'Q.アメリカ合衆国の首都はどこでしょう？', 
' onclick="Q_(1);" >ワシントンDC',
' onclick="Q_(2);" >ニューヨーク',
' onclick="Q_(2);" >ロサンゼルス',
' onclick="Q_(2);" >ドイツ', 
'常識といえば常識ですが、意外と間違いやすいのがこのクイズ。<br/>正解はワシントンDC。ニューヨークではりませんよ。',

'Q.世界三大珍味は何？', 
' onclick="Q_(2);" >うに、からすみ、このわた',
' onclick="Q_(2);" >すし、らーめん、てんぷら',
' onclick="Q_(1);" >フォアグラ、キャビア、トリュフ',
' onclick="Q_(2);" >ちくわ、カレー、シチュー', 
'世界三大珍味は一般的にキャビア・フォアグラ・トリュフと言われています。',
];

/*let c=console.log;
c();
let result = 10000;
let count = 0;
while(true){
  count++;
  result *= 1.03;
  if(result > 1000000) {
    
    c(count + "回目で100万を超えました。")
    break;
   
  }
  
}*/



/*
let rank = "ノーマル";
while (rank !== "スーパーレア"){//ノーマルとスーパーレアが一緒ではない時は文字出力。
  console.log("まだスーパーレアではない");
  let result =Math.random();//if文が消えると永遠とカウントされる。ifが処理を終えるためのコードになっている。
  //c(result);
if(result >= 0.9) {
  rank = "スーパーレア";
}//rankがノーマルの間は永遠となる。
}*/